In [1]:
import pandas as pd

In [2]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',sep='|',index_col='user_id')

In [35]:
print users.info()
print type(users.info())
print users.head(5)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(1), object(3)
memory usage: 76.8+ KB
None
<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(1), object(3)
memory usage: 76.8+ KB
<type 'NoneType'>
         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [36]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [9]:
# 返回值是一个tuple,可以使用切片获取数据
print users.shape
print users.shape[0]
print users.shape[1]

(943, 4)
943
4

In [16]:
# Index对象，可以理解成list，使用切片获取数据
print users.columns
print users.columns[0]
[c for c in users.columns]

Index([u'age', u'gender', u'occupation', u'zip_code'], dtype='object')
age

['age', 'gender', 'occupation', 'zip_code']

In [13]:
print users.index
print len(users.index)
print users.index[9]

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name=u'user_id', length=943)
943
10

In [19]:
# Series对象 每一列为dtype对象
print users.dtypes
print type(users.dtypes)
print users.dtypes[0]
print users.dtypes['age']
[t for t in users.dtypes]

age            int64
gender        object
occupation    object
zip_code      object
dtype: object
<class 'pandas.core.series.Series'>
int64
int64

[dtype('int64'), dtype('O'), dtype('O'), dtype('O')]

In [25]:
occ = users.occupation.head(5)
print occ # Series对象
print type(occ)
print occ[1]
[o for o in occ]

user_id
1    technician
2         other
3        writer
4    technician
5         other
Name: occupation, dtype: object
<class 'pandas.core.series.Series'>
technician

['technician', 'other', 'writer', 'technician', 'other']

In [31]:
oun = users.occupation.unique()
print len(oun)
print type(oun) # numpy ndarray对象
[o for o in oun]

21
<type 'numpy.ndarray'>

['technician',
 'other',
 'writer',
 'executive',
 'administrator',
 'student',
 'lawyer',
 'educator',
 'scientist',
 'entertainment',
 'programmer',
 'librarian',
 'homemaker',
 'artist',
 'engineer',
 'marketing',
 'none',
 'healthcare',
 'retired',
 'salesman',
 'doctor']

In [33]:
# 按照occupation进行分组，查看每一组数量
vc = users.occupation.value_counts()
print len(vc)
print type(vc)
print vc.head(3)

21
<class 'pandas.core.series.Series'>
student     196
other       105
educator     95
Name: occupation, dtype: int64

In [38]:
# 查看当前数据信息
print users.info()
# 查看当前数据的统一
print users.describe()
print type(users.describe())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(1), object(3)
memory usage: 76.8+ KB
None
              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000
<class 'pandas.core.frame.DataFrame'>

In [40]:
users.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [44]:
help(users.age.unique)

Help on method unique in module pandas.core.series:

unique(self) method of pandas.core.series.Series instance
    Return unique values in the object. Uniques are returned in order
    of appearance, this does NOT sort. Hash table-based unique.

    Parameters
    ----------
    values : 1d array-like

    Returns
    -------
    unique values.
      - If the input is an Index, the return is an Index
      - If the input is a Categorical dtype, the return is a Categorical
      - If the input is a Series/ndarray, the return will be an ndarray

    See Also
    --------
    unique
    Index.unique
    Series.unique

In [46]:
print users.occupation.head(2)
users.occupation.describe()

user_id
1    technician
2         other
Name: occupation, dtype: object

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [52]:
# 去除小数点以后的值
print round(3.1415926)
print round(3.50)
print type(users.age.mean()),users.age.mean()
print round(users.age.mean())

3.0
4.0
<type 'float'> 34.051961824
34.0

In [ ]:
print type(users.age)
print type(users.age.value_counts())
print users.age.value_counts().tail(1)
print users.age.tail(1)